app/controllers/members_controller.rb

SELECT * FROM "members"
---
  def index
    @members = Member.all.paginate :page => params[:page], :per_page =>10

SELECT * FROM "members" WHERE ("members"."id" = 0)
---
  def show
    @member = Member.find(params[:id])

SELECT * FROM "members" WHERE ("members"."id" = 8)
---
  def edit
    @member = Member.find(params[:id])

INSERT INTO "members" ("position", "e_board", "created_at", "updated_at", "major", "last_name", "year", "bio", "first_name") VALUES('Telecommunications Chair', 't', '2010-02-13 19:50:49', '2010-02-13 19:50:49', 'Information Systems', 'Sanders', '2011', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry''s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 'Ryan')
---
  def create
    @member = Member.new(params[:member])


    respond_to do |format|
      if @member.save

SELECT * FROM "members" WHERE ("members"."id" = 7)
DELETE FROM "members" WHERE "id" = 7
---
  def destroy
    @member = Member.find(params[:id])
    @member.destroy